---
kind: method
id: M:Autodesk.Revit.DB.PolyLine.GetCoordinates
zh: 多段线、折线
source: html/f6130d0e-2597-bdc2-85b8-0445bbfe4f8a.htm
---
# Autodesk.Revit.DB.PolyLine.GetCoordinates Method

**中文**: 多段线、折线

Gets the coordinate points of the polyline.

## Syntax (C#)
```csharp
public IList<XYZ> GetCoordinates()
```